//
// Created by potato_coder on 06.02.23.
//
#include "../include/app.h"
#include "../include/linear_algebra/quad_matrix.h"

void print_greeting() {
    println(STRING, "████──████──███──████──███──████──████──████──████───███──████──████──████──████\n"
                    "█──█──█──█───█───█──█───█───█──█──█──█──█──█──█──██──█────█──█──█──█──█──█──█──█\n"
                    "████──█──█───█───████───█───█──█──█─────█──█──█──██──███──████────██────██──████\n"
                    "█─────█──█───█───█──█───█───█──█──█──█──█──█──█──██──█────█─█───██────██────█──█\n"
                    "█─────████───█───█──█───█───████──████──████──████───███──█─█───████──████──████");

    println(STRING, "\nДобро пожаловать в консольное приложение.");
}

int app_start(error_s *error) {
    test(error);
    print_greeting();
    console(error);
    return 0;
}